# ----------------------------------------------------------------------------------------------
# 다양한 함수의 형태 - (1) 기본
# ----------------------------------------------------------------------------------------------
# 함수 기능: 팩토리얼을 계산 후 계산 결과를 반환해주는 기능
# 함수 이름: fac
# 매개 변수: x
# 반환값: 팩토리얼
# ----------------------------------------------------------------------------------------------
def fac(x):
    value = 1
    if x and x // 1:
        for count in range(x,0,-1):
            value = value * count
        return value
    elif x == 0:
        return 1
    else:
        print("해당 숫자는 입력이 불가합니다")
print(fac(5))

# ----------------------------------------------------------------------------------------------
# 함수 기능: 팩토리얼을 계산 후 결과를 아래의 형태로 반환해주는 기능
#           예시 결과) 3! = 3 * 2 * 1
# 함수 이름: fac2
# 매개 변수: x
# 반환값: 팩토리얼
# ----------------------------------------------------------------------------------------------
def fac(x):
    value = 1
    if x and x // 1:
        for count in range(x,0,-1):
            value = value * count
            print(f'{x}! : ')
    elif x == 0:
        return 1
    else:
        print("해당 숫자는 입력이 불가합니다")
# 정답
def fac2(x):
    strRet = f'{x}! = '
    intRet = 1
    if x:
        for n in range(x, 0, -1):
            intRet = intRet * n
            strRet = strRet + str(n) + ('*' if n != 1 else '=') # 다 저장하고 출력하면 1번만 출력하면 됨.
            #print(strRet, intRet)

    return strRet + str(intRet)

print(fac2(5))