# -------------------------------------------------------------------------------------------------
# [실습1] 2개의 정수를 입력 받은 후 4칙 연산 수행 결과를 반환하는 기능의 함수를 정의해주세요.
#           - 함수이름: fourCalc
#           - 매개변수: n1, n2
#           - 반환결과: 4칙 연산 결과
# -------------------------------------------------------------------------------------------------
def addTwo(n1, n2):
    print(f'{n1} + {n2} = {n1 + n2}')
    print(f'{n1} - {n2} = {n1 - n2}')
    print(f'{n1} * {n2} = {n1 * n2}')
    print(f'{n1} / {n2} = {n1 / n2}')

# 정답
def fourCalc(n1, n2):
    return n1 + n2, n1 - n2, n1 * n2, n1 / n2 if n2 else '0으로 나눌 수 없음' # 튜플의 형태로 반환하는 것.
print(fourCalc(8,3))

# -------------------------------------------------------------------------------------------------
# [실습2] 문자열을 16진수 코드값으로 변환 후 반환하는 함수를 정의해주세요.
#           - 함수이름: getConde
#           - 매개변수: message
#           - 반환결과: str
# -------------------------------------------------------------------------------------------------
# def getCode(message):
#     for a in range(len(message)):
#         value = ''
#         value = value + str(hex(message[a]))
#     print(value)
# getConde("Happy")

# 정답
def getCode(message):
    ret = ''
    for msg in message:
        ret += hex( ord(msg) ) + ' '
    return ret

print(getCode('Good Luck'))
