# -------------------------------------------------------------------------------------------------------
# 전역변수(Global Variable)와 지역변수(Local Variable)
# -
# -------------------------------------------------------------------------------------------------------
# 사용자 정의 함수 ========================================================================================
def currentDate(todays): # todays => 년, 월, 일을 담고 있는 데이터 타입
    print(f'Today: {todays[0]}/{todays[1]:0>2}/{todays[2]:0>2}')

# 전역변수 ===============================================================================================
year, month, day = 2024, 1, 8
todaysList = [year, month, day]

# 함수 사용, 즉 함수 호출 =================================================================================
print(f'year: {year}, month: {month}, day: {day}')

currentDate(todaysList)

# 변수 값 확인 출력
print(f'year: {year}, month: {month}, day: {day}') # year의 값이 바껴서 출력 >> currentData2에서 전역변수 값이 변경됐기 때문
