# [실습1] 알고 싶은 단을 입력 받고 해당 단을 출력해주세요.
# input() 사용
# 특정 단의 구구단 출력. 단, 반복문 사용하기
# ----------------------------------------------------------
# num = int(input("알고싶은 구구단을 입력해주세요: "))
# for count in range(1,10):
#     print(f'{num} * {count} = {num * count}')

# ---------------------------------------------------------------
# [실습2] 2단 ~ 9단까지 모두 출력하세요. 반복문 사용하기!
# - 중첩 for 반복문
# ---------------------------------------------------------------
for count in range(2,10):
    print(f'==={count}단===')
    for count2 in range(1,10):
        print(f'{count} * {count2} = {count2 * count}')

# ---------------------------------------------------------------
# [실습2] 2단 ~ 9단까지 모두 출력하세요. 반복문 사용하기!
# - 중첩 for 반복문
# 가로로 출력하기
# ---------------------------------------------------------------
for count in range(2,10):
    print(f'---{count}단---', end='      ')
print('\n')
for count2 in range(1,10):
    for count3 in range(2,10):
        print(f' {count3}*{count2} = {count2 * count3:2}', end='     ')
        # print(f' {count3}*{count2} = {count2 * count3}', end='\n' if count3 == 9 else end='     ')
    print('\n')